/* 2353626 贺胡鸣 大数据 */
#include <iostream>
#include "../include/common_prompts.h"
using namespace std;

//hanoi  输入提示词
const char* hanoi_prompts[] = {
    "1.基本解",
    "2.基本解(步数记录)",
    "3.内部数组显示(横向)",
    "4.内部数组显示(纵向+横向)",
    "5.图形解-预备-画三个圆柱",
    "6.图形解-预备-在起始柱上画n个盘子",
    "7.图形解-预备-第一次移动",
    "8.图形解-自动移动版本",
    "9.图形解-游戏版",
    "0.退出",
    nullptr
};

//pullze 输入提示词
const char* pullze_prompts[] = {
    " A.内部数组，原样输出",
    " B.内部数组，生成提示行列并输出",
    " C.内部数组，游戏版",
    " --------------------------------------------------------",
    " D.n*n的框架(无分隔线)，原样输出",
    " E.n*n的框架(无分隔线)，含提示行列",
    " F.n*n的框架(无分隔线)，显示初始状态，鼠标移动可显示坐标",
    " G.cmd图形界面完整版(无分隔线)",
    " --------------------------------------------------------",
    " H.n*n的框架(有分隔线)，原样输出",
    " I.n*n的框架(有分隔线)，含提示行列",
    " J.n*n的框架(有分隔线)，显示初始状态，鼠标移动可显示坐标",
    " K.cmd图形界面完整版(有分隔线)",
    " --------------------------------------------------------",
    " Q.退出",
    nullptr
};